OpenFOAM-v2106/tutorials/lagrangian/reactingParcelFoam/recycleParticles/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale     1;

vertices
(
    ( 0 0 0 )
    ( 1 0 0 )
    ( 2 0 0 )
    ( 4 0 0 )
    ( 4 1 0 )
    ( 2 1 0 )
    ( 2 2 0 )
    ( 1 2 0 )
    ( 1 1 0 )
    ( 0 1 0 )

    ( 0 0 0.1 )
    ( 1 0 0.1 )
    ( 2 0 0.1 )
    ( 4 0 0.1 )
    ( 4 1 0.1 )
    ( 2 1 0.1 )
    ( 2 2 0.1 )
    ( 1 2 0.1 )
    ( 1 1 0.1 )
    ( 0 1 0.1 )
);

blocks
(
    hex (0 1 8 9 10 11 18 19) ( 10 10 1 ) simpleGrading ( 1 1 1 )
    hex (1 2 5 8 11 12 15 18) ( 10 10 1 ) simpleGrading ( 1 1 1 )
    hex (2 3 4 5 12 13 14 15) ( 20 10 1 ) simpleGrading ( 1 1 1 )
    hex (8 5 6 7 18 15 16 17) ( 10 10 1 ) simpleGrading ( 1 1 1 )
);

edges
(
);

defaultPatch
{
    name        frontAndBack;
    type        empty;
}

boundary
(
    inlet1
    {
        type        patch;
        faces
        (
            (0 10 19 9)
        );
    }
    inlet2
    {
        type        patch;
        faces
        (
            (7 17 16 6)
        );
    }
    outlet
    {
        type        patch;
        faces
        (
            (3 4 14 13)
        );
    }
    walls
    {
        type        wall;
        faces
        (
            (0 1 11 10)
            (1 2 12 11)
            (2 3 13 12)
            (9 19 18 8)
            (8 18 17 7)
            (5 6 16 15)
            (5 15 14 4)
        );
    }
);


// ************************************************************************* //
